Autodesk.Revit.UI.PushButtonData.AvailabilityClassName
The full class name for the class providing the entry point to decide availability of this push button.
Remarks: This is the class implementing IExternalCommandAvailability interface.
Since: 2011

Autodesk.Revit.UI.PushButtonData.AssemblyName
The assembly path of the button.
Remarks: The path of the assembly which contains the corresponding external command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when setting the value to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when setting the value to an empty string.

Autodesk.Revit.UI.PushButtonData.ClassName
The name of the class containing the implementation for the command.
Remarks: The class name which implements the interface IExternalCommand.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when setting the value to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when setting the value to an empty string.

Autodesk.Revit.UI.PushButtonData.#ctor(System.String,System.String,System.String,System.String)
Constructs a new instance of PushButtonData.
name: The internal name of the new button.
text: The user visible text seen on the new button.
assemblyName: The assembly path of the button.
className: The name of the class containing the implementation for the command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when null is passed for one or more arguments.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an empty string is passed for one or more arguments.

Autodesk.Revit.UI.PushButtonData
This class contains information necessary to construct a push button in the Ribbon.